{
    "architectures": [
        "LingxiForCausalLM"
    ],
    "auto_map": {
        "AutoConfig": "configuration_lingxi.LingxiConfig",
        "AutoModel": "modeling_lingxi.LingxiModel",
        "AutoModelForCausalLM": "modeling_lingxi.LingxiForCausalLM"
    },
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "hidden_act": "silu",
    "hidden_size": 896,
    "initializer_range": 0.02,
    "intermediate_size": 3840,
    "max_position_embeddings": 4096,
    "model_type": "lingxi",
    "num_attention_heads": 14,
    "num_hidden_layers": 24,
    "num_key_value_heads": 14,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 500000.0,
    "tie_word_embeddings": true,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.40.2",
    "use_cache": true,
    "vocab_size": 151936
}
